package ru.itmo.homeworks.homework6.Task3;

//Задача 3. Коты и мыши
//        Класс Мышь: скорость.
//        Класс Кот: имя, скорость, вес, пойманные мыши;
//        Кот хранит информацию о пойманных мышах (максимум о 100).
//        Кот ловит мышь, только, если его скорость выше, чем у мыши.
//        Кот может напасть на другого кота и, если он больше противника (по весу),
//        то может отобрать его мышей (если скорость мыши выше, чем скорость кота, она убежит).

public class Application {
    public static void main(String[] args) {

    }
}
